A grid that is a sub-grid of a multi-segment grid can only be mirrored if the entire multi-segment grid is being mirrored.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId GridInGridChainCannotMirror { get; }
  Visual Basic
Public Shared ReadOnly Property GridInGridChainCannotMirror As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ GridInGridChainCannotMirror {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures GridFailures Class
  Autodesk.Revit.DB Namespace